{
  "backend/main.mo": "Motoko backend defining profiles, jobs, applications, messages, and access-controlled CRUD/query functions with ID counters.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten mapping of various frontend file paths to concise functional descriptions.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark theme CSS variables and base styling.",
  "frontend/index.html": "Main HTML entry point setting page title to M Employed and mounting the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app in theme provider and layout components.",
  "frontend/src/components/applications/ApplicationStatusBadge.tsx": "Displays an application status as a styled badge with status‑dependent variant and label.",
  "frontend/src/components/applications/ApplicationStatusSelect.tsx": "Dropdown allowing employers to update an application's status with mutation and toast feedback.",
  "frontend/src/components/applications/ApplyToJobCard.tsx": "Job application form or existing‑application view handling submission, validation, and status display.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate prompting users to log in with Internet Identity before accessing protected pages.",
  "frontend/src/components/auth/RoleGate.tsx": "Shows an access restriction message when the user's account type doesn't match the required role, offering navigation and settings options.",
  "frontend/src/components/common/EmptyState.tsx": "Displays a centered icon, title, description, and optional action for empty or no‑content states.",
  "frontend/src/components/jobs/JobForm.tsx": "Form for creating or editing job postings with fields for details, skills, and publication or deletion actions.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation, authentication handling, responsive menus, and user profile controls.",
  "frontend/src/components/messages/MessageComposer.tsx": "Message input component allowing text entry and sending with Enter support and a send button.",
  "frontend/src/components/messages/MessageThread.tsx": "Renders a scrollable list of messages, styling them based on sender identity and showing an empty state when none exist.",
  "frontend/src/components/profile/CandidateProfileForm.tsx": "Candidate profile editor for updating location, skills, and bio using profile update hooks.",
  "frontend/src/components/profile/EmployerProfileForm.tsx": "Employer profile form for editing company name, location, and description with validation and update handling.",
  "frontend/src/components/profile/SkillsInput.tsx": "Skill entry widget allowing adding, removing, and listing skills via input and badges.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useApplications.ts": "Provides React Query hooks for fetching and mutating job applications, including applying, status updates, and retrieving candidate or job-specific applications.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile via the actor with loading state adjustments.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context handling login, identity loading, and auth-client setup.",
  "frontend/src/hooks/useJobs.ts": "Contains hooks for job CRUD, job search, employer jobs, and related profile queries using React Query.",
  "frontend/src/hooks/useMemberCount.ts": "Fetches total platform member count from the actor.",
  "frontend/src/hooks/useMessages.ts": "Provides hooks to fetch messages for an application and send new messages with cache invalidation.",
  "frontend/src/hooks/useProfile.ts": "Supports creating and updating user profiles and fetching candidate profiles via React Query and actor methods.",
  "frontend/src/index.css": "Tailwind base theme configuration defining light and dark mode color variables and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPlatformPage.tsx": "Renders the About page describing the platform's mission, features, values, and CTA using UI components.",
  "frontend/src/pages/candidate/CandidateDashboardPage.tsx": "Shows a candidate’s job applications with statuses, loading states, and links to job and message views.",
  "frontend/src/pages/employer/EmployerDashboardPage.tsx": "Displays an employer’s job postings, platform member count, and provides navigation to create new jobs.",
  "frontend/src/pages/employer/JobApplicationsPage.tsx": "Lists applications for a specific job, showing candidate details, messages, and allowing status changes.",
  "frontend/src/pages/employer/JobEditorPage.tsx": "Handles creating and editing jobs, including saving, deleting, and toggling publication status with auth checks.",
  "frontend/src/pages/FounderAboutPage.tsx": "Renders a founder profile page with photo, biography, vision sections, and a call-to-action card.",
  "frontend/src/pages/JobDetailPage.tsx": "Displays detailed job information, company profile, and application UI, handling loading and not-found states.",
  "frontend/src/pages/JobsBrowsePage.tsx": "Shows a searchable, filterable list of published jobs with loading skeletons and sidebar filters.",
  "frontend/src/pages/LandingPage.tsx": "Implements the marketing landing page with hero content, feature sections, and logic to route authenticated users.",
  "frontend/src/pages/MessagesThreadPage.tsx": "Provides a message thread view for a job application with fetching, refreshing, and sending messages.",
  "frontend/src/pages/OnboardingPage.tsx": "Handles new-user onboarding, allowing selection of account type and name before creating an account.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the user profile page, showing profile forms based on account type with loading and auth handling.",
  "frontend/src/pages/SettingsPage.tsx": "Displays account settings and allows switching account type, with identity checks and update logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and clean them from hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins.",
  "project_state.json": "Tracks project metadata, feature states, and rename requests for replacing 'Caffeine Jobs' with 'M Employed'."
}