{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Employer dashboard member count (frontend)",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Create a React Query hook to fetch and cache the total member count from the backend actor under a stable query key.",
      "acceptanceCriteria": [
        "A new hook exists (in a non-immutable path) that calls the backend member-count method via the existing actor pattern.",
        "The hook uses React Query (`useQuery`) and is enabled only when the actor is ready (consistent with existing hooks such as `useGetCallerUserProfile` and `useGetEmployerJobs`).",
        "The query key is deterministic (e.g., `['memberCount']`) so it can be cached and refetched predictably."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useMemberCount.ts",
          "operation": "create",
          "description": "Add a new React Query hook (e.g., `useMemberCount`) that uses `useActor()` and `useQuery` to call the backend actor member-count capability (`getTotalMembersCount`) and caches results under a deterministic query key (e.g., `['memberCount']`). Ensure the query is enabled only when the actor is available and not fetching, and return loading state consistent with existing hook patterns."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Show the total member count in a small stats card near the top of the Employer Dashboard, with loading skeleton and safe fallback on error.",
      "acceptanceCriteria": [
        "Employer Dashboard renders a card/section labeled \"Total members\" (English text) and shows the numeric count returned by the backend.",
        "While the member count is loading, the UI shows a skeleton/placeholder consistent with existing loading patterns.",
        "If the member count cannot be loaded due to authorization or other errors, the page remains usable and shows a safe fallback (e.g., \"Total members: —\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/employer/EmployerDashboardPage.tsx",
          "operation": "modify",
          "description": "Integrate the new `useMemberCount` hook and render a compact stats Card near the top of the page labeled \"Total members\". Show a Skeleton placeholder while the query is loading, and on errors (including authorization failures) display a safe fallback value (e.g., '—') without blocking the rest of the dashboard UI."
        }
      ]
    }
  ]
}